Ran Plan for dir: `eu-central-1/staging` workspace: `default`

<details><summary>Show Output</summary>

```diff
data.aws_iam_group.forge_team: Reading...
data.aws_iam_group.forge_team: Read complete after 1s [id=AGPAQXAMAB3KSV2SQL2OV]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # aws_iam_group_policy_attachment.forge_team_staging_policy will be created
+ resource "aws_iam_group_policy_attachment" "forge_team_staging_policy" {
      + group      = "forge-data-engineers"
      + id         = (known after apply)
      + policy_arn = (known after apply)
    }

  # aws_iam_policy.forge-team-generic-access will be created
+ resource "aws_iam_policy" "forge-team-generic-access" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Forge team access policy"
      + id               = (known after apply)
      + name             = "forge_team_generic_access"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.forge_data_lake.aws_s3_bucket.federated-engineers-bucket will be created
+ resource "aws_s3_bucket" "federated-engineers-bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "federated-engineers-staging-forge-datalake"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_region               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = "eu-central-1"
      + request_payer               = (known after apply)
      + tags                        = {
          + "Name"        = "federated-engineers-staging-forge-datalake"
          + "Service"     = "airflow"
          + "environment" = "staging"
          + "team"        = "forge"
          + "terraform"   = "true"
        }
      + tags_all                    = {
          + "Name"        = "federated-engineers-staging-forge-datalake"
          + "Service"     = "airflow"
          + "environment" = "staging"
          + "team"        = "forge"
          + "terraform"   = "true"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # module.forge_data_lake.aws_s3_bucket_versioning.versioning will be created
+ resource "aws_s3_bucket_versioning" "versioning" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + region = "eu-central-1"

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Disabled"
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d eu-central-1/staging
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://161.97.80.18:4141/lock?id=Federated-Engineers%252Fforge-cloud-infrastructures%252Feu-central-1%252Fstaging%252Fdefault%252F)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d eu-central-1/staging
  ```
Plan: 4 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```